app/controllers/todos_controller.rb

    def get_todos
        render json: Todo.all
---
SELECT "todos".* FROM "todos"

    def create
        # title = params[:title]
        # description = params[:description]
        # priority = params[:priority]

        todo = Todo.create(body_params)
---
INSERT INTO "todos" ("title", "description", "status", "priority", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Coder"], ["description", "Code all day"], ["status", 0], ["priority", 2], ["created_at", "2023-03-15 08:50:18.139525"], ["updated_at", "2023-03-15 08:50:18.139525"]]

    def update
        todo = Todo.find_by(id: params[:id].to_i)
        todo.update(body_params)
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "todos" SET "title" = ?, "description" = ?, "priority" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "Coder"], ["description", "Code all day"], ["priority", 2], ["updated_at", "2023-03-15 08:58:57.730810"], ["id", 1]]